In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'salary':[125,245,126.],
                   'num':[12,15,14],
                   'name':['Jack','Jhon', 'Juli'],
                   'enter':[True, False, True]})
df

   salary  num  name  enter
0   125.0   12  Jack   True
1   245.0   15  Jhon  False
2   126.0   14  Juli   True

In [8]:
S1 = pd.Series([12,15,16.])
S1

0    12.0
1    15.0
2    16.0
dtype: float64

# dtype

In [5]:
df.dtypes

salary    float64
num         int64
name       object
enter        bool
dtype: object

# select_dtype

In [9]:
df

   salary  num  name  enter
0   125.0   12  Jack   True
1   245.0   15  Jhon  False
2   126.0   14  Juli   True

In [12]:
df.select_dtypes( include=['float','int64', 'bool'])

   salary  num  enter
0   125.0   12   True
1   245.0   15  False
2   126.0   14   True

In [13]:
df.select_dtypes( exclude='object')

   salary  num  enter
0   125.0   12   True
1   245.0   15  False
2   126.0   14   True

# convert_dtype

In [ ]:
best, true, False

In [29]:
df3 = pd.DataFrame({'a':pd.Series([125,18,19], dtype='float'),
                    'b':pd.Series(['aa','bb','cc'], dtype='object')})

In [30]:
df3

       a   b
0  125.0  aa
1   18.0  bb
2   19.0  cc

In [31]:
df4 = df3.convert_dtypes()
df4

     a   b
0  125  aa
1   18  bb
2   19  cc

In [32]:
df4.dtypes

a     Int64
b    string
dtype: object